Ran Plan for dir: `terraform-example-gcp` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_instance.instance1 will be created
+ resource "google_compute_instance" "instance1" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = [
          + {
              + count = 3
              + type  = "nvidia-tesla-t4"
            },
        ]
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "n1-standard-32"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "instance1"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags_fingerprint     = (known after apply)
      + zone                 = "us-central1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "debian-cloud/debian-9"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = true
          + on_host_maintenance = (known after apply)
          + preemptible         = true
        }
    }

  # google_dns_record_set.frontend will be created
+ resource "google_dns_record_set" "frontend" {
      + id           = (known after apply)
      + managed_zone = "zone"
      + name         = "frontend.123"
      + project      = (known after apply)
      + rrdatas      = [
          + "123.123.123.123]",
        ]
      + ttl          = 300
      + type         = "A"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
  NAME                                               MONTHLY QTY  UNIT   PRICE   HOURLY COST  MONTHLY COST  

  google_compute_instance.instance1                                                                         
  [90m├─ Linux/UNIX usage (preemptible, n1-standard-32)[0m          [90m730[0m  [90mhours[0m  [90m0.3200[0m       [90m0.3200[0m      [90m233.6000[0m  
  [90m├─ Standard provisioned storage (pd-standard)[0m               [90m10[0m  [90mGiB[0m    [90m0.0400[0m       [90m0.0005[0m        [90m0.4000[0m  
  [90m└─ NVIDIA Tesla T4 (preemptible)[0m                         [90m2,190[0m  [90mhours[0m  [90m0.1100[0m       [90m0.3300[0m      [90m240.9000[0m  
  Total                                                                               0.6505      474.9000  
                                                                                                            
  OVERALL TOTAL (USD)                                                                 0.6505      474.9000  

1 resource type wasn't estimated as it's not supported yet, rerun with --show-skipped to see.
Please watch/star https://github.com/infracost/infracost as new resources are added regularly.
100  6366  100  1238  100  5128   8308  34416 --:--:-- --:--:-- --:--:-- 42724

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform-example-gcp`
* :put_litter_in_its_place: To **delete** this plan click [here](http://349e9e0036e1:4141/lock?id=infracost%252Finfracost-atlantis%252Fterraform-example-gcp%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform-example-gcp`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
